###############################################################################
# Created by write_sdc
# Thu Dec 25 18:25:24 2025
###############################################################################
current_design pipeline_proc_chip
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk_sys -period 10.0000 [get_ports {clk}]
set_propagated_clock [get_clocks {clk_sys}]
###############################################################################
# Environment
###############################################################################
###############################################################################
# Design Rules
###############################################################################
